---
### IMPORT LIBS

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine as ce

---

## CONNECT DB

In [2]:
# NEED INSTALL THE PYMYSQL MODULE
en=ce('mysql+pymysql://root:root@localhost/Veiculos')

## CREATE BRANDS TABLE IN DB

In [3]:
pd.read_csv('brands.csv').to_sql('brands', if_exists='replace', index=False, con=en)

194

---

## READING BRANDS TABLE

In [5]:
df_b = pd.read_sql_table('brands',con=en)

## READING FIPE FILE

In [6]:
df_f = pd.read_excel('fipe.xls')

WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero

---

## FUNCTIONS CREATOR

In [8]:
# FUNCTION TO CONSULT FIP X BRANDS
def f_con(f_col: str,b_col: str,cols: str or list):
    return df_f[~df_f[f_col].isin(df_b[b_col])][cols]

# FUNCTION TO CONSULT BRANDS X FIPE
def b_con(f_col: str,b_col: str,cols: list):
    return df_b[~df_b[b_col].isin(df_f[f_col])][cols]

---

## CONSULTS

#### FIPE X TABLE - BRANDS

In [12]:
f_name_b = f_con('Marca', 'name', ['codigoMarca','Marca', 'codigoTipoVeiculo'])
f_name_b.shape

(751, 3)

In [13]:
type(f_name_b)

pandas.core.frame.DataFrame

#### FIPE X TABLE - ID_BRANDS

In [14]:
f_id_b = f_con('codigoMarca', 'id_veiculo_marca', ['codigoMarca','Marca', 'codigoTipoVeiculo'])
f_id_b.shape

(815, 3)

COMPARATION ID | NAME

In [15]:
# FUNCTION TO CONSULT FIP X BRANDS
def f_con(f_col: str,b_col: str,cols: str or list):
    return df_f[~df_f[f_col].isin(df_b[b_col])][cols]

In [16]:
f_id_b = f_con('codigoMarca', 'id_veiculo_marca', ['codigoMarca','Marca', 'codigoTipoVeiculo'])

In [17]:
com = (
    pd.concat(
        [
            f_id_b[['codigoMarca', 'Marca']]
                .rename(columns={'codigoMarca':'POR ID - ID', 'Marca':'POR ID - MARCA'}),
            f_name_b[['codigoMarca', 'Marca']]
                .rename(columns={'codigoMarca':'POR MARCA - ID', 'Marca':'POR MARCA - MARCA'})
        ], axis=1
    )
)

In [18]:
com.insert(2, ' COMP', ' <-> ', True)

In [19]:
f_id_b[f_id_b.Marca=='IVECO'].drop_duplicates()

       codigoMarca  Marca  codigoTipoVeiculo
12942          208  IVECO                  1

In [20]:
com.drop_duplicates()

       POR ID - ID    POR ID - MARCA   COMP  POR MARCA - ID POR MARCA - MARCA
1393         207.0              Baby   <->            207.0              Baby
2771         238.0               BYD   <->            238.0               BYD
2798         236.0        CAB Motors   <->            236.0        CAB Motors
2813         245.0        Caoa Chery   <->            245.0        Caoa Chery
3992         241.0        D2D Motors   <->            241.0        D2D Motors
4081         246.0              DFSK   <->            246.0              DFSK
11504        240.0               GWM   <->            240.0               GWM
11549        214.0   HITECH ELECTRIC   <->            214.0   HITECH ELECTRIC
12942        208.0             IVECO   <->              NaN               NaN
15683        211.0           Mclaren   <->            211.0           Mclaren
22856        247.0             SERES   <->            247.0             SERES
28025        216.0           AVELLOZ   <->            216.0           AVELLOZ
28042        205.0               BEE   <->            205.0               BEE
28782        212.0              BULL   <->            212.0              BULL
29432        248.0             FEVER   <->            248.0             FEVER
29448        209.0  FUSCO MOTOSEGURA   <->            209.0  FUSCO MOTOSEGURA
29659        203.0            HAOJUE   <->            203.0            HAOJUE
32496        204.0             KYMCO   <->            204.0             KYMCO
32850        239.0               NIU   <->            239.0               NIU
32993        210.0           POLARIS   <->            210.0           POLARIS
33622        237.0        SUPER SOCO   <->            237.0        SUPER SOCO
34806        244.0    Ventane Motors   <->            244.0    Ventane Motors
34819        215.0             VOLTZ   <->            215.0             VOLTZ
34829        243.0             WATTS   <->            243.0             WATTS
35626        242.0            ZONTES   <->            242.0            ZONTES
35912        206.0           BEPOBUS   <->            206.0           BEPOBUS
38441        188.0               JAC   <->              NaN               NaN
2863           NaN               NaN   <->            161.0  Caoa Chery/Chery

TRATMENT AND SEND TO SQL

In [21]:
new_b = f_name_b[f_name_b.Marca.isin(f_id_b.Marca)][['codigoMarca','Marca', 'codigoTipoVeiculo']].drop_duplicates()

In [22]:
new_b

       codigoMarca             Marca  codigoTipoVeiculo
1393           207              Baby                  1
2771           238               BYD                  1
2798           236        CAB Motors                  1
2813           245        Caoa Chery                  1
3992           241        D2D Motors                  1
4081           246              DFSK                  1
11504          240               GWM                  1
11549          214   HITECH ELECTRIC                  1
15683          211           Mclaren                  1
22856          247             SERES                  1
28025          216           AVELLOZ                  2
28042          205               BEE                  2
28782          212              BULL                  2
29432          248             FEVER                  2
29448          209  FUSCO MOTOSEGURA                  2
29659          203            HAOJUE                  2
32496          204             KYMCO                  2
32850          239               NIU                  2
32993          210           POLARIS                  2
33622          237        SUPER SOCO                  2
34806          244    Ventane Motors                  2
34819          215             VOLTZ                  2
34829          243             WATTS                  2
35626          242            ZONTES                  2
35912          206           BEPOBUS                  3

In [23]:
new_b.insert(2, 'status', 1, True)

In [24]:
new_b = new_b.rename(columns={'codigoMarca':'id_veiculo_marca','Marca':'name','codigoTipoVeiculo':'type'})

In [25]:
new_b.to_sql('brands', if_exists='append', index=False, con=en)

25

## CONFIRM IF THE VALUES IS INSERT

In [26]:
df_b2 = pd.read_csv('brands.csv')

In [27]:
df_b2[~df_b2.name.isin(df_b.name)]['name']

Series([], Name: name, dtype: object)

In [28]:
df_f[~df_f.Marca.isin(df_b2.name)][['codigoMarca','Marca']].drop_duplicates()

       codigoMarca             Marca
1393           207              Baby
2771           238               BYD
2798           236        CAB Motors
2813           245        Caoa Chery
2863           161  Caoa Chery/Chery
3992           241        D2D Motors
4081           246              DFSK
11504          240               GWM
11549          214   HITECH ELECTRIC
15683          211           Mclaren
22856          247             SERES
28025          216           AVELLOZ
28042          205               BEE
28782          212              BULL
29432          248             FEVER
29448          209  FUSCO MOTOSEGURA
29659          203            HAOJUE
32496          204             KYMCO
32850          239               NIU
32993          210           POLARIS
33622          237        SUPER SOCO
34806          244    Ventane Motors
34819          215             VOLTZ
34829          243             WATTS
35626          242            ZONTES
35912          206           BEPOBUS

In [29]:
df_b[df_b.id_veiculo_marca==161][['id_veiculo_marca','name']]

     id_veiculo_marca   name
155               161  CHERY

In [30]:
df_f[df_f.codigoMarca==161][['codigoMarca','Marca']].drop_duplicates()

      codigoMarca             Marca
2863          161  Caoa Chery/Chery

In [31]:
df_f[~df_f.codigoMarca.isin(df_b2.id_veiculo_marca)][['codigoMarca','Marca']].drop_duplicates()

       codigoMarca             Marca
1393           207              Baby
2771           238               BYD
2798           236        CAB Motors
2813           245        Caoa Chery
3992           241        D2D Motors
4081           246              DFSK
11504          240               GWM
11549          214   HITECH ELECTRIC
12942          208             IVECO
15683          211           Mclaren
22856          247             SERES
28025          216           AVELLOZ
28042          205               BEE
28782          212              BULL
29432          248             FEVER
29448          209  FUSCO MOTOSEGURA
29659          203            HAOJUE
32496          204             KYMCO
32850          239               NIU
32993          210           POLARIS
33622          237        SUPER SOCO
34806          244    Ventane Motors
34819          215             VOLTZ
34829          243             WATTS
35626          242            ZONTES
35912          206           BEPOBUS
38441          188               JAC

In [32]:
df_b[df_b.name=='JAC'][['id_veiculo_marca','name']]

     id_veiculo_marca name
169               177  JAC

---

## MODELS

## CREATE MODELS TABLE IN DB

In [33]:
pd.read_csv('models.csv').to_sql('models', if_exists='replace', index=False, con=en)

7698

---

## READING MODELS TABLE

In [34]:
df_m = pd.read_sql_table('models',con=en)

In [35]:
# FUNCTION TO CONSULT FIP X BRANDS
def fm_con(f_col: str,m_col: str,cols: list):
    return df_f[~df_f[f_col].isin(df_m[m_col])][cols]
# FUNCTION TO CONSULT MODELS X FIPE
def m_con(f_col: str,m_col: str,cols: list):
    return df_m[~df_m[m_col].isin(df_f[f_col])][cols]

---

#### FIPE X TABLE - MODELS

In [36]:
f_name_m = fm_con('Modelo', 'name', ['codigoModelo','Modelo', 'codigoMarca'])
f_name_m.shape

(14166, 3)

#### FIPE X TABLE - ID_BRANDS

In [37]:
f_id_m = fm_con('codigoModelo', 'id_veiculo_modelo', ['codigoModelo','Modelo', 'codigoMarca'])

COMPARATION ID | NAME

In [38]:
pd.concat([f_id_m,f_name_m], axis=1).drop_duplicates()

,codigoModelo,Modelo,codigoMarca,codigoModelo,Modelo,codigoMarca
83,10883.0,MARRUÁ AM 200 Esc. 3.8 TDI Die.Aut. (E6),2.0,10883.0,MARRUÁ AM 200 Esc. 3.8 TDI Die.Aut. (E6),2.0
86,9352.0,MARRUÁ AM 200 Escolar 2.8 TDI Diesel,2.0,9352.0,MARRUÁ AM 200 Escolar 2.8 TDI Diesel,2.0
88,10884.0,MARRUÁ AM 200 Escolar 3.8 TDI Die. (E6),2.0,10884.0,MARRUÁ AM 200 Escolar 3.8 TDI Die. (E6),2.0
91,9353.0,MARRUÁ AM 200 Microbus 2.8 TDI Diesel,2.0,9353.0,MARRUÁ AM 200 Microbus 2.8 TDI Diesel,2.0
93,10864.0,MARRUÁ AM 250 3.8 CD TDI Die. Aut. (E6),2.0,10864.0,MARRUÁ AM 250 3.8 CD TDI Die. Aut. (E6),2.0
...,...,...,...,...,...,...
46138,NaN,NaN,NaN,6687.0,VM 330 8x2 2p (diesel) (E5),116.0
46148,NaN,NaN,NaN,6688.0,VM 330 8x4 2p (diesel) (E5),116.0
46195,NaN,NaN,NaN,4572.0,Phanter Special Escolar 2p (diesel),144.0
46207,NaN,NaN,NaN,4573.0,Phanter Special Exec./Turismo 2p (die.),144.0
46219,NaN,NaN,NaN,4574.0,Phanter Special Urbano/SPTRANS 2p (die.),144.0

---

TRATMENT AND SEND TO SQL

In [39]:
new_m = f_name_m[f_name_m.Modelo.isin(f_id_m.Modelo)][['codigoModelo','Modelo', 'codigoMarca']].drop_duplicates()

In [40]:
new_m.insert(2, 'status', 1, True)

In [41]:
new_m = new_m.rename(columns={'codigoModelo':'id_veiculo_modelo','Modelo':'name','codigoMarca':'fk_veiculo_marca'})

In [42]:
new_m.to_sql('models', if_exists='append', index=False, con=en)

2769

---

## CONFIRM IF THE VALUES IS INSERT

In [43]:
df_m2 = pd.read_csv('models.csv')

In [44]:
new_m[~new_m.name.isin(df_m2.name)][['id_veiculo_modelo','name']]

       id_veiculo_modelo                                      name
83                 10883  MARRUÁ AM 200 Esc. 3.8 TDI Die.Aut. (E6)
86                  9352      MARRUÁ AM 200 Escolar 2.8 TDI Diesel
88                 10884   MARRUÁ AM 200 Escolar 3.8 TDI Die. (E6)
91                  9353     MARRUÁ AM 200 Microbus 2.8 TDI Diesel
93                 10864   MARRUÁ AM 250 3.8 CD TDI Die. Aut. (E6)
...                  ...                                       ...
46158              10543               VM 360 4X2 2p (diesel) (E6)
46161              10544                VM 360 6x2 2p (diesel)(E6)
46164              10648                VM 360 6x4 2p (diesel)(E6)
46167              10545               VM 360 8X2 2p (diesel) (E6)
46170              10649               VM 360 8X4 2p (diesel) (E6)

[2769 rows x 2 columns]

INSERT NEW MODELS FROM NEW BRANDS

In [45]:
new_m[~new_m.fk_veiculo_marca.isin(df_m2.fk_veiculo_marca)][['id_veiculo_modelo', 'name', 'fk_veiculo_marca']]

       id_veiculo_modelo                         name  fk_veiculo_marca
1437                8276    Buggy RS Evolution 1.8 8V               207
2771                9902             D1 EV (Elétrico)               238
2774               10813        Dolphin EV (Elétrico)               238
2776               10986      Dolphin Mini (Elétrico)               238
2778               10878      Dolphin Plus (Elétrico)               238
...                  ...                          ...               ...
38443              10902          E-JT 9,5 (Elétrico)               188
38445               6315         iEV 1200T (Elétrico)               188
38450               9728    iEV 1200T PLUS (Elétrico)               188
38453               9729  iEV 1200T PLUS R (Elétrico)               188
38456               9730       iEV 1200T R (Elétrico)               188

[227 rows x 3 columns]

UPDATE NEW MODELS FROM EXIST BRANDS

In [46]:
new_m[new_m.fk_veiculo_marca.isin(df_m2.fk_veiculo_marca)][['id_veiculo_modelo', 'name', 'fk_veiculo_marca']]

,id_veiculo_modelo,name,fk_veiculo_marca
83,10883,MARRUÁ AM 200 Esc. 3.8 TDI Die.Aut. (E6),2
86,9352,MARRUÁ AM 200 Escolar 2.8 TDI Diesel,2
88,10884,MARRUÁ AM 200 Escolar 3.8 TDI Die. (E6),2
91,9353,MARRUÁ AM 200 Microbus 2.8 TDI Diesel,2
93,10864,MARRUÁ AM 250 3.8 CD TDI Die. Aut. (E6),2
...,...,...,...
46158,10543,VM 360 4X2 2p (diesel) (E6),116
46161,10544,VM 360 6x2 2p (diesel)(E6),116
46164,10648,VM 360 6x4 2p (diesel)(E6),116
46167,10545,VM 360 8X2 2p (diesel) (E6),116
46170,10649,VM 360 8X4 2p (diesel) (E6),116

CONSULTS

In [47]:
df_m2[df_m2.fk_veiculo_marca==116][['id_veiculo_modelo', 'name']]

      id_veiculo_modelo                                     name
3647               3727                FH-12 380 4X2 2p (diesel)
3648               3728                FH-12 380 6x2 2p (diesel)
3649               3729                FH-12 380 6x4 2p (diesel)
3650               3730   FH-12 380 GLOBETROTTER 4X2 2p (diesel)
3651               3731   FH-12 380 GLOBETROTTER 6x2 2p (diesel)
...                 ...                                      ...
7450               7580  FH-460 GLOBETROTTER 8X2 2p (diesel)(E5)
7451               7581               FH-500 8X2 2p (diesel)(E5)
7452               7582  FH-500 GLOBETROTTER 8X2 2p (diesel)(E5)
7453               7583               FH-540 8X2 2p (diesel)(E5)
7454               7584  FH-540 GLOBETROTTER 8X2 2p (diesel)(E5)

[182 rows x 2 columns]

In [48]:
new_m[new_m.fk_veiculo_marca==116][['id_veiculo_modelo', 'name']]

       id_veiculo_modelo                                      name
44990              10483               FH-420 4X2 2p (diesel) (E6)
45004              10484               FH-420 6X2 2p (diesel) (E6)
45018              10485               FH-420 6X4 2p (diesel) (E6)
45021              10486               FH-420 8X2 2p (diesel) (E6)
45042              10487  FH-420 GLOBETROTTER 4X2 2p (diesel) (E6)
...                  ...                                       ...
46158              10543               VM 360 4X2 2p (diesel) (E6)
46161              10544                VM 360 6x2 2p (diesel)(E6)
46164              10648                VM 360 6x4 2p (diesel)(E6)
46167              10545               VM 360 8X2 2p (diesel) (E6)
46170              10649               VM 360 8X4 2p (diesel) (E6)

[78 rows x 2 columns]